import pytest
from src.wiget import mask_account_card
from src.wiget import get_date

@pytest.mark.parametrize("card_number, expected", [
    ('Maestro 1596837868705199', 'Maestro 1596 83** **** 5199'),
    ('Счет 64686473678894779589', 'Счет **9589'),
    ('Maestro 15968378687051y9', 'Номер карты набран не верно'),
    ('Maestro 15968378687051 9', 'Номер карты набран не верно'),
    ('Maestro 0006837868705119', 'Номер карты набран не верно'),
    ('1596837868705199', '1596 83** **** 5199'),
    ('64686473678894779589', 'Счет **9589'),
    ('Счет 00006473678894779589', 'Номер счета набран не верно'),
    ('Счет 111164736788947795Y9', 'Номер счета набран не верно'),
    ('Счет 111164736788947795 9', 'Номер счета набран не верно'),
    ('Счет 1111647--67889477959', 'Номер счета набран не верно'),
    ('Maestro 123368378-8705119', 'Номер карты набран не верно')

])
def test_mask_account_card(card_number, expected):
    assert mask_account_card(card_number) == expected