

import pytest

from src.wiget import get_date
from src.wiget import mask_account_card


@pytest.mark.parametrize(
    "card_number, expected",
    [
        ("Maestro 1596837868705199", "Maestro 1596 83** **** 5199"),
        ("Счет 64686473678894779589", "Счет **9589"),
        ("Maestro 15968378687051y9", "Номер карты набран не верно"),
        ("Maestro 15968378687051 9", "Номер карты набран не верно"),
        ("Maestro 0006837868705119", "Номер карты набран не верно"),
        ("1596837868705199", "1596 83** **** 5199"),
        ("64686473678894779589", "Счет **9589"),
        ("Счет 00006473678894779589", "Номер счета набран не верно"),
        ("Счет 1234647367889 779589", "Номер счета набран не верно"),
        ("Счет 1234647367889-779589", "Номер счета набран не верно"),
        ("Счет 1234FD73678891779589", "Номер счета набран не верно"),
    ],
)
def test_mask_account_card(card_number: str, expected: str) -> None:
    """Функция для проверки правильности маскировки номера карты или счета"""
    assert mask_account_card(card_number) == expected


@pytest.mark.parametrize(
    "format_date, expected",
    [
        ("2024-03-11T02:26:18.671407", "11.03.2024"),
        ("2024-03-11T02:26:18", "11.03.2024"),
        ("2024-12-31", "31.12.2024"),
        ("31.12.2024", "31.12.2024"),
        ("December 31, 2024", "31.12.2024"),
        ("ddmmgggg", "Ошибка: неверный формат даты"),
        ("", "Ошибка: неверный формат даты"),
    ],
)
def test_get_date(format_date: str, expected: str) -> None:
    """Функция для проверки правильности конвертации даты в формат ДД.ММ.ГГГГ"""
    assert get_date(format_date) == expected
